{"config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "padding": "valid", "dtype": "float32", "name": "conv2d_1", "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "batch_input_shape": [null, 28, 28, 3]}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "padding": "valid", "name": "conv2d_2", "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_1", "units": 128, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_2", "units": 10, "bias_constraint": null, "activation": "softmax", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.6"}